In [173]:
import  pandas as pd

In [174]:
titanic_file = './titanic.csv'

In [175]:
df = pd.read_csv(titanic_file)

In [176]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [178]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [179]:
# show cols of df as dictionary
save = df.columns.tolist()
save_dtype = ['bool', 'category', 'category', 'float', 'int', 'int', 'float', 'category', 'category', 'category', 'bool','category','category', 'bool', 'bool']

In [180]:
df = df.astype(dict(zip(save,save_dtype)))
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,True,False
1,True,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False
2,True,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True
3,True,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False
4,False,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,True,True
887,True,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,True,True
888,False,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,True,False
889,True,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,True,True
890,False,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,True,True

In [181]:
# find people with survied = True and age < 10
def ageinterval(j):
    def surviveunder10(i, j):
        survived = df['survived'].isin([True])
        agemask =  df['age'].between(i-j,i,inclusive='left')
        survivedcnt = len(df[survived & agemask])
        allpeople = len(df[agemask])
        return survivedcnt / allpeople if allpeople != 0 else -1
    # # find all people whose age is under ten
    for i in range(j,int(df.age.max())+j+1,j):
        result = surviveunder10(i, j)
        if result >= 0:
            print(f"{i-j}세 이상 {i}세 미만 생존률 : {result * 100 :.2f} %")

ageinterval(10)

# show people whose age is higher than 60
age_mask = df['age'] > 60
df[age_mask]

0세 이상 10세 미만 생존률 : 61.29 %
10세 이상 20세 미만 생존률 : 40.20 %
20세 이상 30세 미만 생존률 : 35.00 %
30세 이상 40세 미만 생존률 : 43.71 %
40세 이상 50세 미만 생존률 : 38.20 %
50세 이상 60세 미만 생존률 : 41.67 %
60세 이상 70세 미만 생존률 : 31.58 %
70세 이상 80세 미만 생존률 : 0.00 %
80세 이상 90세 미만 생존률 : 100.00 %

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
33,False,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,True,True
54,False,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,True,False
96,False,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,True,True
116,False,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,True,True
170,False,1,male,61.0,0,0,33.5000,S,First,man,True,B,Southampton,True,True
252,False,1,male,62.0,0,0,26.5500,S,First,man,True,C,Southampton,True,True
275,True,1,female,63.0,1,0,77.9583,S,First,woman,False,D,Southampton,True,False
280,False,3,male,65.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,True,True
326,False,3,male,61.0,0,0,6.2375,S,Third,man,True,NaN,Southampton,True,True
438,False,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,True,False
456,False,1,male,65.0,0,0,26.5500,S,First,man,True,E,Southampton,True,True
483,True,3,female,63.0,0,0,9.5875,S,Third,woman,False,NaN,Southampton,True,True
493,False,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,True,True
545,False,1,male,64.0,0,0,26.0000,S,First,man,True,NaN,Southampton,True,True
555,False,1,male,62.0,0,0,26.5500,S,First,man,True,NaN,Southampton,True,True
570,True,2,male,62.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,True,True
625,False,1,male,61.0,0,0,32.3208,S,First,man,True,D,Southampton,True,True
630,True,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,True,True
672,False,2,male,70.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,True,True
745,False,1,male,70.0,1,1,71.0000,S,First,man,True,B,Southampton,True,False
829,True,1,female,62.0,0,0,80.0000,NaN,First,woman,False,B,NaN,True,True
851,False,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,True,True

In [182]:
# show the people who is child in who column and survied is True
child_mask = df['who'] == 'child'
total = df[child_mask & df['survived']].shape[0] + df[child_mask & ~df['survived']].shape[0]
survivedchild = df[child_mask & df['survived']].shape[0]

print(f"어린이 {total}명 생존률 {survivedchild / total * 100 :.2f}%")

어린이 83명 생존률 59.04%

In [183]:
# show percentage of total survived people
total_survived = df[df['survived']].shape[0]
print(f"전체 {df.shape[0]}명 생존률 {total_survived / df.shape[0] * 100 :.2f}%")

전체 891명 생존률 38.38%

In [184]:
# show percentage of adult male survival rate from adult_male
adult_male_mask = df['adult_male']
total_adult_male = df[adult_male_mask].shape[0]
survived_adult_male = df[adult_male_mask & df['survived']].shape[0]

print(f"성인 남성 {total_adult_male}명 생존률 {survived_adult_male / total_adult_male * 100 :.2f}%")

성인 남성 537명 생존률 16.39%

In [185]:
# show percentage of non adult male survival rate from adult_male
non_adult_male_mask = df['adult_male'] == False
total_non_adult_male = df[non_adult_male_mask].shape[0]
survived_non_adult_male = df[non_adult_male_mask & df['survived']].shape[0]

print(f"이외 {total_non_adult_male}명 생존률 {survived_non_adult_male / total_non_adult_male * 100 :.2f}%")

이외 354명 생존률 71.75%

In [186]:
# show percentage of female survival rate by using sex columns
female_mask = df['sex'] == 'female'
total_female = df[female_mask].shape[0]
survived_female = df[female_mask & df['survived']].shape[0]

print(f"여성 {total_female}명 생존률 {survived_female / total_female * 100 :.2f}%")

여성 314명 생존률 74.20%

In [187]:
# survival rate of first class people
for x in sorted(df['class'].unique().tolist()):
    class_mask = df['class'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    print(f"{x} class {total_class_mask}명 생존률 {survived_class / total_class_mask * 100 :.2f}%")

First class 216명 생존률 62.96%
Second class 184명 생존률 47.28%
Third class 491명 생존률 24.24%

In [188]:
# survival rate of first class people
for x in sorted(df['class'].unique().tolist()):
    class_mask = df['class'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    for y in sorted(df['sex'].unique().tolist()):
        sex_mask = df['sex'] == y
        total_targetsex = df[sex_mask & class_mask].shape[0]
        survived_targetsex = df[sex_mask & class_mask & df['survived']].shape[0]
        print(f"{x} class {y} 생존률 {survived_targetsex / total_targetsex * 100 :.2f}%")

First class female 생존률 96.81%
First class male 생존률 36.89%
Second class female 생존률 92.11%
Second class male 생존률 15.74%
Third class female 생존률 50.00%
Third class male 생존률 13.54%

In [189]:
for x in sorted(df['alone'].unique().tolist()):
    class_mask = df['alone'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    for y in sorted(df['sex'].unique().tolist()):
        sex_mask = df['sex'] == y
        total_targetsex = df[sex_mask & class_mask].shape[0]
        survived_targetsex = df[sex_mask & class_mask & df['survived']].shape[0]
        print(f"나홀로 {'맞는' if x else '아닌'} {y} 생존률 {survived_targetsex / total_targetsex * 100 :.2f}%")

나홀로 아닌 female 생존률 71.28%
나홀로 아닌 male 생존률 27.11%
나홀로 맞는 female 생존률 78.57%
나홀로 맞는 male 생존률 15.57%

In [190]:
for x in sorted(df['embark_town'].unique().dropna().tolist()):
    class_mask = df['embark_town'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    for y in sorted(df['sex'].unique().tolist()):
        sex_mask = df['sex'] == y
        total_targetsex = df[sex_mask & class_mask].shape[0]
        survived_targetsex = df[sex_mask & class_mask & df['survived']].shape[0]
        print(f"출항지 {x}, {y} 생존률 {survived_targetsex / total_targetsex * 100 :.2f}%")

출항지 Cherbourg, female 생존률 87.67%
출항지 Cherbourg, male 생존률 30.53%
출항지 Queenstown, female 생존률 75.00%
출항지 Queenstown, male 생존률 7.32%
출항지 Southampton, female 생존률 68.97%
출항지 Southampton, male 생존률 17.46%

In [191]:
# show top ten most fair paid people in df
df_top_fare = df.sort_values(by='fare', ascending=False)
df_top_fare

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,True,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,True,True
737,True,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,True,True
679,True,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,True,False
88,True,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,True,False
27,False,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
633,False,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,True,True
413,False,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,True,True
822,False,1,male,38.0,0,0,0.0000,S,First,man,True,NaN,Southampton,True,True
732,False,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,True,True
674,False,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,True,True

In [192]:
def interval(j):
    def survivalrate_fare(i, j):
        # show people who paid fair between 100 and 150 inclusive both
        df_top_fare_100_150 = len(df_top_fare[(df_top_fare['fare'] >= j * i) & (df_top_fare['fare'] < j * i + j)])
        # show people who survived with above condtion
        df_top_fare_100_150_survived = len(df_top_fare[(df_top_fare['fare'] >= j * i) & (df_top_fare['fare'] < j * i + j) & (df_top_fare['survived'])])
        return (df_top_fare_100_150_survived /  df_top_fare_100_150 if  df_top_fare_100_150 != 0 else -1), df_top_fare_100_150
    
    for x in range(0, (int(df.fare.max()) // j) + 1):
        result, people = survivalrate_fare(x, j)
        if result >= 0:
            print(f"{j * x} 달러 ~ {j * x + j} 달러 지불한 {people}명 사람의 생존률 {result * 100:.2f}%")
interval(50)

0 달러 ~ 50 달러 지불한 730명 사람의 생존률 31.92%
50 달러 ~ 100 달러 지불한 108명 사람의 생존률 64.81%
100 달러 ~ 150 달러 지불한 24명 사람의 생존률 79.17%
150 달러 ~ 200 달러 지불한 9명 사람의 생존률 66.67%
200 달러 ~ 250 달러 지불한 11명 사람의 생존률 63.64%
250 달러 ~ 300 달러 지불한 6명 사람의 생존률 66.67%
500 달러 ~ 550 달러 지불한 3명 사람의 생존률 100.00%

In [193]:
for x in sorted(df['sibsp'].unique().tolist()):
    class_mask = df['sibsp'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    print(f"형제 {x} 명 {total_class_mask}명 생존률 {survived_class / total_class_mask * 100 :.2f}%")

형제 0 명 608명 생존률 34.54%
형제 1 명 209명 생존률 53.59%
형제 2 명 28명 생존률 46.43%
형제 3 명 16명 생존률 25.00%
형제 4 명 18명 생존률 16.67%
형제 5 명 5명 생존률 0.00%
형제 8 명 7명 생존률 0.00%

In [194]:
for x in sorted(df['parch'].unique().tolist()):
    class_mask = df['parch'] == x
    total_class_mask = df[class_mask].shape[0]
    survived_class = df[class_mask & df['survived']].shape[0]
    print(f"보호자동승 {x} 명 {total_class_mask}명 생존률 {survived_class / total_class_mask * 100 :.2f}%")

보호자동승 0 명 678명 생존률 34.37%
보호자동승 1 명 118명 생존률 55.08%
보호자동승 2 명 80명 생존률 50.00%
보호자동승 3 명 5명 생존률 60.00%
보호자동승 4 명 4명 생존률 0.00%
보호자동승 5 명 5명 생존률 20.00%
보호자동승 6 명 1명 생존률 0.00%

In [195]:
# percentage of male and female in df
print(f"남자 비율 {len(df[df['sex'] == 'male']) / len(df) * 100:.2f}%")
print(f"여자 비율 {len(df[df['sex'] == 'female']) / len(df) * 100:.2f}%")

남자 비율 64.76%
여자 비율 35.24%